RDVMI.rdvmi-ext/src/InformationRegisters/рдв_ЖурналСобытий/рдв_ЖурналСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_ЖурналСобытий</name>
  <resources>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СообщениеИнтеграции</name>
    <type>
      <types>CatalogRef.рдв_СообщенияИнтеграции</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВыгружаемыйОбъект</name>
    <type>
      <types>CatalogRef.рдв_ВыгружаемыеОбъекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.рдв_События</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнешняяСистема</name>
    <type>
      <types>CatalogRef.рдв_ВнешниеСистемы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RDVMI.rdvmi-ext/src/Enums/рдв_СостоянияОчередейОбработкиДанных/рдв_СостоянияОчередейОбработкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_СостоянияОчередейОбработкиДанных</name>
  <comment>VELO-625</comment>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>Пропущена</name>
  </enumValues>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

RDVMI.rdvmi-ext/src/Enums/рдв_События/рдв_События.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_События</name>
  <enumValues>
    <name>ДобавленВОчередь</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрированоИзменение</name>
  </enumValues>
  <enumValues>
    <name>ИсходящееСообщение</name>
  </enumValues>
  <enumValues>
    <name>ВходящееСообщение</name>
  </enumValues>
</mdclass:Enum>

RDVMI.rdvmi-ext/src/Enums/рдв_НаправленияСообщенийИнтеграции/рдв_НаправленияСообщенийИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_НаправленияСообщенийИнтеграции</name>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
</mdclass:Enum>

RDVMI.rdvmi-ext/src/CommonModules/рдв_ЖурналСобытий/Module.bsl
Процедура рдв_ЖурналСобытийПриЗаписиОчередиПриЗаписи(Источник, Отказ, Замещение) Экспорт
	Для Каждого Запись Из Источник Цикл
		ВестиЖурналСобытий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ТипОчереди, "ВестиЖурналСобытий");
		Если ВестиЖурналСобытий И Запись.Состояние = Перечисления.рдв_СостоянияОчередейОбработкиДанных.Новая Тогда
			Событие = Перечисления.рдв_События.ДобавленВОчередь;
			РегистрыСведений.рдв_ЖурналСобытий.ЗарегистрироватьСобытие(Запись.ИдентификаторЗаписи,,,Запись.Объект,Событие,, Запись.ДатаСоздания);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура рдв_ЖурналСобытийПриЗаписиРегистрацииПриЗаписи(Источник, Отказ, Замещение) Экспорт
	Для Каждого Запись Из Источник Цикл
		Событие = Перечисления.рдв_События.ЗарегистрированоИзменение;
		СсылкаНаОбъект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВыгружаемыйОбъект, "СсылкаНаОбъект");
		РегистрыСведений.рдв_ЖурналСобытий.ЗарегистрироватьСобытие(Запись.ИдентификаторСобытия,
																	Запись.ИдентификаторСообщения,
																	Запись.ВыгружаемыйОбъект,
																	СсылкаНаОбъект,
																	Событие,
																	Запись.ВнешняяСистема,
																	Запись.ДатаРегистрации);
	КонецЦикла;
КонецПроцедуры

Процедура рдв_ЖурналСобытийПриЗаписиСообщенияПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда
		Если Источник.Направление = Перечисления.рдв_НаправленияСообщенийИнтеграции.Исходящее Тогда
			Событие = Перечисления.рдв_События.ИсходящееСообщение;
		Иначе
			Событие = Перечисления.рдв_События.ВходящееСообщение;
		КонецЕсли;
		
		ОбъектыПоИдентификаторуСобытия = ОбъектыПоИдентификаторуСобытия(Источник.ИдентификаторСобытия);
		
		Если ОбъектыПоИдентификаторуСобытия.Количество() = 0 Тогда
		
			РегистрыСведений.рдв_ЖурналСобытий.ЗарегистрироватьСобытие(Источник.ИдентификаторСобытия,
																		Источник.ИдентификаторСообщения,
																		,
																		,
																		Событие,
																		Источник.ВнешняяСистема,
																		ТекущаяДатаСеанса(),
																		Источник.Ссылка);
		Иначе
			Для Каждого СсылкаНаОбъект Из ОбъектыПоИдентификаторуСобытия Цикл
				РегистрыСведений.рдв_ЖурналСобытий.ЗарегистрироватьСобытие(Источник.ИдентификаторСобытия,
																			Источник.ИдентификаторСообщения,
																			,
																			СсылкаНаОбъект,
																			Событие, 
																			Источник.ВнешняяСистема,
																			ТекущаяДатаСеанса(),
																			Источник.Ссылка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура рдв_ЖурналСобытийПередЗаписьюСообщенияПередЗаписью(Источник, Отказ) Экспорт
	
	Если Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
		Источник.ДополнительныеСвойства.Вставить("ЭтоНовый");
	КонецЕсли;
	
КонецПроцедуры

Функция ОбъектыПоИдентификаторуСобытия(ИдентификаторСобытия)

	МассивОбъектов = Новый Массив;
	Если ЗначениеЗаполнено(ИдентификаторСобытия) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	рдв_ЖурналСобытий.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.рдв_ЖурналСобытий КАК рдв_ЖурналСобытий
		|ГДЕ
		|	рдв_ЖурналСобытий.ИдентификаторСобытия = &ИдентификаторСобытия
		|	И рдв_ЖурналСобытий.Событие = ЗНАЧЕНИЕ(Перечисление.рдв_События.ЗарегистрированоИзменение)";
		
		Запрос.УстановитьПараметр("ИдентификаторСобытия", ИдентификаторСобытия);
		МассивОбъектов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СсылкаНаОбъект");
	КонецЕсли;
	Возврат МассивОбъектов;
	
КонецФункции
